Autodesk.Revit.DB.Visual.SchemaCommon.Category
The property labeled "Category" common to all visual Asset types.
Remarks:
This property is of type "AssetPropertyString".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.Keyword
The property labeled "Keyword" common to all visual Asset types.
Remarks:
This property is of type "AssetPropertyString".
Use ":" to add several keywords.
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.UIName
The property labeled "UIName" common to all visual Asset types.
Remarks:
This property is of type "AssetPropertyString".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.Description
The property labeled "Description" common to all visual Asset types.
Remarks:
This property is of type "AssetPropertyString".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.Thumbnail
The property labeled "Thumbnail" common to all visual Asset types.
Remarks:
This property is a "AssetPropertyList" of type "AssetPropertyString".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.BaseSchema
The property labeled "BaseSchema" common to all visual Asset types.
Remarks:
This property is of type "AssetPropertyString".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.VersionGUID
The property labeled "VersionGUID" common to all visual Asset types.
Remarks:
This property is of type "AssetPropertyString" and will contain a uuid.
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.Hidden
The property labeled "Hidden" common to all visual Asset types.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon
A static class that provides access to the property names that appear in all the visual Asset types.
Since:
2018.1